gururaj-shet/dsPIC-AI-Demo-AEC-EQ/src/touch/touch.c
/*******************************************************************************
  @Company
    Microchip Technology Inc.

  @File Name
    touch.c

  @Summary
    QTouch Modular Library

  @Description
    Provides Initialization, Processing and ISR handler of touch library,
    Simple API functions to get/set the key touch parameters from/to the
    touch library data structures.
	
*******************************************************************************/
/*
© [2025] Microchip Technology Inc. and its subsidiaries.

    Subject to your compliance with these terms, you may use Microchip 
    software and any derivatives exclusively with Microchip products. 
    You are responsible for complying with 3rd party license terms  
    applicable to your use of 3rd party software (including open source  
    software) that may accompany Microchip software. SOFTWARE IS ?AS IS.? 
    NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS 
    SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT,  
    MERCHANTABILITY, OR FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT 
    WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, 
    INCIDENTAL OR CONSEQUENTIAL LOSS, DAMAGE, COST OR EXPENSE OF ANY 
    KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF 
    MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE 
    FORESEEABLE. TO THE FULLEST EXTENT ALLOWED BY LAW, MICROCHIP?S 
    TOTAL LIABILITY ON ALL CLAIMS RELATED TO THE SOFTWARE WILL NOT 
    EXCEED AMOUNT OF FEES, IF ANY, YOU PAID DIRECTLY TO MICROCHIP FOR 
    THIS SOFTWARE.
*/

/*******************************************************************************
 * NOTE: The touch library contains pre-release code intended solely for
 * demonstration purposes. It is not intended for production use.
 *******************************************************************************/

#ifndef TOUCH_C
#define TOUCH_C

#include "app_specific_config_defs.h"
////
#if defined(ENA_TOUCH)
////
#include<xc.h>
//#include "touch.h"
#include "qtm_acq_dspic33a_0x0051_api.h"
#include "qtm_touch_key_0x0002_api.h"
#include "qtm_freq_hop_auto_0x0004_api.h"
#include "qtm_scroller_0x000b_api.h"
#include "osc_drv.h"


#include "touch.h"


#warning "The touch library contains pre-release code intended solely for demonstration purposes. It is not intended for production use."

/*----------------------------------------------------------------------------
 *   prototypes
 *----------------------------------------------------------------------------*/

/*! \brief Touch post process complete callback function prototype.
 */
static void qtm_post_process_complete();

/*! \brief configure keys, wheels and sliders.
 */
static touch_ret_t touch_sensors_config(void);

/*! \brief Device config.
 */
static touch_ret_t touch_device_config(void);

/*! \brief Touch Error callback function prototype.
 */
static void qtm_error_callback(uint8_t error);

/*! \brief Timer config.
 */
static void touch_timer_config(void);


/*----------------------------------------------------------------------------
 *     Global Variables
 *----------------------------------------------------------------------------*/
/* Measurement Done Touch Flag  */
volatile uint8_t measurement_done_touch = 0;

/* Error Handling */
volatile uint8_t module_error_code = 0;

/* track touch in progress flag */
volatile uint8_t touch_in_progress = 0u;

/* post-process request flag */
volatile uint8_t touch_postprocess_request = 0;

/* Flag to indicate time for touch measurement */
volatile uint8_t time_to_measure_touch_flag = 0;

/* Acquisition module internal data - Size to largest acquisition set */

uint32_t touch_acq_signals_raw[DEF_NUM_CHANNELS];

/*----------------------------------------------------------------------------
 *     Acquisition Module
 *----------------------------------------------------------------------------*/

/* Acquisition set 1 - General settings */
qtm_acq_node_group_config_t adc_qtlib_acq_gen1 = 
    {DEF_NUM_CHANNELS, DEF_SENSOR_TYPE, DEF_SEL_FREQ_INIT};

/* Node status, signal, calibration values */
qtm_acq_node_data_t adc_qtlib_node_stat1[DEF_NUM_CHANNELS];

/* Node configurations */
qtm_acq_dspic33a_node_config_t adc_seq_node_cfg1[DEF_NUM_CHANNELS] = { NODE_0_PARAMS, NODE_1_PARAMS, NODE_2_PARAMS};

qtm_acq_dspic33a_device_config_t device_config = {
    .adc_clk_src = FRC,
    .device_id = DSPIC33_AK512MPS
};


/* Container */
qtm_acquisition_control_t qtlib_acq_set1 = 
{
    .qtm_acq_node_group_config = &adc_qtlib_acq_gen1,
    .qtm_acq_node_config = &adc_seq_node_cfg1[0],
    .qtm_acq_node_data = &adc_qtlib_node_stat1[0],
    .qtm_acq_device_config =&device_config,
};

/**********************************************************/
/*********** Frequency Hop Auto tune Module **********************/
/**********************************************************/

/* Buffer used with various noise filtering functions */
uint16_t noise_filter_buffer[DEF_NUM_SENSORS * NUM_FREQ_STEPS];
uint8_t freq_hop_delay_selection[NUM_FREQ_STEPS] = {DEF_MEDIAN_FILTER_FREQUENCIES};
uint8_t freq_hop_autotune_counters[NUM_FREQ_STEPS];

/* Configuration */
qtm_freq_hop_autotune_config_t qtm_freq_hop_autotune_config1 = 
    {
        DEF_NUM_CHANNELS,
        NUM_FREQ_STEPS,
        (uint8_t*)&(adc_qtlib_acq_gen1.freq_option_select),
        &freq_hop_delay_selection[0],
        DEF_FREQ_AUTOTUNE_ENABLE,
        FREQ_AUTOTUNE_MAX_VARIANCE,
        FREQ_AUTOTUNE_COUNT_IN
    };

/* Data */
qtm_freq_hop_autotune_data_t qtm_freq_hop_autotune_data1 = 
{
    0, 
    0, 
    &noise_filter_buffer[0], 
    &adc_qtlib_node_stat1[0], 
    &freq_hop_autotune_counters[0]
};

/* Container */
qtm_freq_hop_autotune_control_t qtm_freq_hop_autotune_control1 = 
{
    &qtm_freq_hop_autotune_data1, 
    &qtm_freq_hop_autotune_config1
};

/**********************************************************/
/*********************** Keys Module **********************/
/**********************************************************/

/* Keys set 1 - General settings */
qtm_touch_key_group_config_t qtlib_key_grp_config_set1 = 
{
    DEF_NUM_SENSORS,
    DEF_TOUCH_DET_INT,
    DEF_MAX_ON_DURATION,
    DEF_ANTI_TCH_DET_INT,
    DEF_ANTI_TCH_RECAL_THRSHLD,
    DEF_TCH_DRIFT_RATE,
    DEF_ANTI_TCH_DRIFT_RATE,
    DEF_DRIFT_HOLD_TIME,
    DEF_REBURST_MODE
};

qtm_touch_key_group_data_t qtlib_key_grp_data_set1;

