gururaj-shet/dsPIC-AI-Demo-AEC-EQ/src/touch/touch.c
    uint32_t adc_clk_src_frequency = 0uL;
    uint32_t fvco_frequency = 0uL;
    uint16_t pll_pre = 0uL;
    uint16_t pll_fbd = 0uL;
    uint16_t pll_div1 = 0uL;
    uint16_t pll_div2 = 0uL;
    uint16_t int_div = 0uL;


//MO added
    // NOSC PLL1 Out output; OE enabled; SIDL disabled; ON enabled; BOSC Backup FRC Oscillator; FSCMEN disabled; DIVSWEN disabled; OSWEN disabled; EXTCFSEL External clock fail detection module #1; EXTCFEN disabled; RIS disabled; SLEEPDLY 8 sys_clk delay; 
    CLK6CON = 0x29580UL;
    // FRACDIV 0x0; INTDIV 0x0; 
    CLK6DIV = 0x0UL;
    //enable clock switching
    CLK6CONbits.OSWEN = 1U;
#ifndef __MPLAB_DEBUGGER_SIMULATOR    
    //wait for clock switching complete
    while(CLK6CONbits.OSWEN == 1U){};
#endif
//MO added


    uint16_t local_nosc = CLK6CONbits.NOSC;
    adc_clock_src_t adc_clock_src = device_config.adc_clk_src;
    

    /* calculate frequency */
    if(adc_clock_src == FRC)
    {    
        if(local_nosc == 5u)
        {
            pll_pre = PLL1DIVbits.PLLPRE;
            pll_fbd = PLL1DIVbits.PLLFBDIV;
            pll_div1 = PLL1DIVbits.POSTDIV1;
            pll_div2 = PLL1DIVbits.POSTDIV2;
        }
        else if(local_nosc == 6u)
        {
            pll_pre = PLL2DIVbits.PLLPRE;
            pll_fbd = PLL2DIVbits.PLLFBDIV;
            pll_div1 = PLL2DIVbits.POSTDIV1;
            pll_div2 = PLL2DIVbits.POSTDIV2;
        }
        else if(local_nosc == 7u)
        {
            pll_pre = PLL1DIVbits.PLLPRE;
            pll_fbd = PLL1DIVbits.PLLFBDIV;
            int_div = VCO1DIVbits.INTDIV;
        }
        else if(local_nosc == 8u)
        {
            pll_pre = PLL2DIVbits.PLLPRE;
            pll_fbd = PLL2DIVbits.PLLFBDIV;
            int_div = VCO2DIVbits.INTDIV;
        }
        
        if (pll_pre == 0u)
        {
            pll_pre = 1u; /* avoid divide by 0 */
        }
        if (pll_fbd == 0u)
        {
            pll_fbd = 1u; /* avoid divide by 0 */
        }
        if (pll_div1 == 0u)
        {
            pll_div1 = 1u; /* avoid divide by 0 */
        }
        if (pll_div2 == 0u)
        {
            pll_div2 = 1u; /* avoid divide by 0 */
        }
        if (int_div == 0u)
        {
            int_div = 1u; /* avoid divide by 0 */
        }
        
        if(local_nosc == 5u)
        {
            #if defined (FRC_CLK_FREQ)
            fvco_frequency = ((FRC_CLK_FREQ * (pll_fbd & 0x00ffu)) / pll_pre)/(pll_div1 * pll_div2);
            #endif
        }
        else if(local_nosc == 6u)
        {
            #if defined (FRC_CLK_FREQ)
            fvco_frequency = ((FRC_CLK_FREQ * (pll_fbd & 0x00ffu)) / pll_pre)/(pll_div1 * pll_div2);
            #endif
        }
        else if(local_nosc == 7u)
        {
            #if defined (FRC_CLK_FREQ)
            fvco_frequency = ((FRC_CLK_FREQ * (pll_fbd & 0x00ffu)) / pll_pre)/(int_div * 2u);
            #endif
        }
        else if(local_nosc == 8u)
        {
            #if defined (FRC_CLK_FREQ)
            fvco_frequency = ((FRC_CLK_FREQ * (pll_fbd & 0x00ffu)) / pll_pre)/(int_div * 2u);
            #endif
        }
            
    
        adc_clk_src_frequency = fvco_frequency;
    }
    else
    {
            /* invalid */
    }

    device_config.adc_clk_src_freq = adc_clk_src_frequency;
    
    if(adc_clk_src_frequency > MAX_INPUT_ADC_CLK_FREQ)
    {
        touch_ret = TOUCH_INVALID_INPUT_PARAM;
    }
    else 
    {
            /* invalid */
    }
    
    return touch_ret;
}
#endif //01

uint16_t interrupt_cnt = 0u;
/*============================================================================
void touch_timer_handler(void)
------------------------------------------------------------------------------
Purpose: This function updates the time elapsed to the touch key module to
         synchronize the internal time counts used by the module.
Input  : none
Output : none
Notes  :
============================================================================*/
void touch_timer_handler(void)
{
    interrupt_cnt++;
	if (interrupt_cnt >= DEF_TOUCH_MEASUREMENT_PERIOD_MS)
    {                      
        interrupt_cnt = 0;
		/* Count complete - Measure touch sensors */
        time_to_measure_touch_flag = 1u;
        qtm_update_qtlib_timer(DEF_TOUCH_MEASUREMENT_PERIOD_MS);
    }
}

/*============================================================================
void touch_timer_config(void)
------------------------------------------------------------------------------
Purpose: register Timer callback
Input  : none
Output : none
Notes  :
============================================================================*/
static void touch_timer_config(void)
{  
}

/*============================================================================
void touch_check_node_cc_cal(void)
------------------------------------------------------------------------------
Purpose: This function is used to stop calibration on the nodes that exceeds the maximum calibration counter 
Input  : none
Output : none
Notes  :
============================================================================*/
uint8_t cal_count[DEF_NUM_CHANNELS] = {0u};
void touch_check_node_cc_cal(void)
{

    uint16_t node_num = 0u;
    

	for (node_num = 0u; node_num < DEF_NUM_CHANNELS; node_num++)
	{
		if( (adc_qtlib_node_stat1[node_num].node_acq_status &  (NODE_CC_CAL << NODE_STATUS_POS)) != 0u)
		{
			if( cal_count[node_num] > DEF_MAX_CC_CAL_COUNT )
			{
				/* stop calibration - set the last computed CC value */
				qtm_set_sensor_node_cal(&qtlib_acq_set1, node_num, adc_qtlib_node_stat1[node_num].node_comp_caps);
				/* reset counter */
				cal_count[node_num] = 0u;
			
			}
			else
			{	/* increment counter */
				cal_count[node_num]++;
			}
		}
	}
}

/*============================================================================
void touch_init(void)
------------------------------------------------------------------------------
Purpose: Initialization of touch library. PTC, timer, and
         datastreamer modules are initialized in this function.
Input  : none
Output : none
Notes  :
============================================================================*/
void touch_init(void)
{
    touch_ret_t touch_ret = TOUCH_SUCCESS;

