gururaj-shet/dsPIC-AI-Demo-AEC-EQ/src/touch/touch.c
    touch_ret = touch_device_config();

    if(TOUCH_SUCCESS != touch_ret)
    {
        /* Acq module Error Detected */
        qtm_error_callback(0x81);
    }

    touch_timer_config();

    touch_ret = touch_sensors_config();
    if (TOUCH_SUCCESS != touch_ret)
    {
        /* Acq module Error Detected: Issue an Acq module common error code 0x80 */
        qtm_error_callback(0x81);
    }

    /* Set Freq Hop Time scale */
    touch_ret = qtm_update_acq_freq_delay(DEF_FREQ_HOP_TIME_SCALE);
    if (TOUCH_SUCCESS != touch_ret)
    {
        /* Acq module Error Detected: Issue an Acq module common error code 0x80 */
        qtm_error_callback(0x81);
    }
}


void touch_process( uint32_t tick_1ms )
{
    touch_ret_t touch_ret = TOUCH_SUCCESS;


///////////
    static uint32_t LastTouch = 0;
    if( tick_1ms > LastTouch )
    {
        // every 1ms
        LastTouch = tick_1ms;
        touch_timer_handler();
    }
///////////


    /* check the time_to_measure_touch for Touch Acquisition */
    if ((time_to_measure_touch_flag == 1u) && (touch_in_progress == 0u) && (touch_postprocess_request==0u))
    {
        
        touch_ret = qtm_itc_start_measurement_seq(&qtlib_acq_set1, qtm_measure_complete_callback);
        
        if (TOUCH_SUCCESS == touch_ret) {
            /* Clear the Measure request flag */
			time_to_measure_touch_flag = 0u;
            /* set in progress flag */
            touch_in_progress = 1u;
        }
        else
        {
            /* Acq module Error Detected: Issue an Acq module common error code 0x80 */
            qtm_error_callback(0x81);
        }
    }
    
    /* check the flag for node level post processing */
    if (touch_postprocess_request == 1u)
    {
        /* clear in progress flag */
        touch_in_progress = 0u;
        /* Reset the flags for node_level_post_processing */
        touch_postprocess_request = 0u;
        /* Run Acquisition module level post processing*/
        touch_ret = qtm_acquisition_process();
        
        touch_check_node_cc_cal();
        
        if(TOUCH_SUCCESS == touch_ret)
        {            
            /* Returned with success: Start module level post processing */
            touch_ret = qtm_freq_hop_autotune(&qtm_freq_hop_autotune_control1);
            if (TOUCH_SUCCESS != touch_ret) {
                qtm_error_callback(0x41);
            }
            
            touch_ret = qtm_key_sensors_process(&qtlib_key_set1);
            if (TOUCH_SUCCESS != touch_ret)
            {
                qtm_error_callback(0x42);
            }
            #if(SCROLLER_ENABLE == 1u)
            touch_ret = qtm_scroller_process(&qtm_scroller_control1);
            if (TOUCH_SUCCESS != touch_ret)
            {
                qtm_error_callback(0x43);
            }
            #endif
        }
        else
        {
            /* Acq module Error Detected: Issue an Acq module common error code 0x80 */
            qtm_error_callback(0x80);
        }


        if (0u != (qtlib_key_set1.qtm_touch_key_group_data->qtm_keys_status & QTM_KEY_REBURST))
        {
            time_to_measure_touch_flag = 1u;
        }
        else
        {
            measurement_done_touch = 1u;
        }
        qtm_post_process_complete();
    }
}
// void touch_process(void)
// {   
//     touch_ret_t touch_ret = TOUCH_SUCCESS;
//     
//     /* check the time_to_measure_touch for Touch Acquisition */
//     if ((time_to_measure_touch_flag == 1u) && (touch_in_progress == 0u) && (touch_postprocess_request==0u))
//     {
//         
//         touch_ret = qtm_itc_start_measurement_seq(&qtlib_acq_set1, qtm_measure_complete_callback);
//         
//         if (TOUCH_SUCCESS == touch_ret) {
//             /* Clear the Measure request flag */
// 			time_to_measure_touch_flag = 0u;
//             /* set in progress flag */
//             touch_in_progress = 1u;
//         }
//         else
//         {
//             /* Acq module Error Detected: Issue an Acq module common error code 0x80 */
//             qtm_error_callback(0x81);
//         }
//     }
//     
//     /* check the flag for node level post processing */
//     if (touch_postprocess_request == 1u)
//     {
//         /* clear in progress flag */
//         touch_in_progress = 0u;
//         /* Reset the flags for node_level_post_processing */
//         touch_postprocess_request = 0u;
//         /* Run Acquisition module level post processing*/
//         touch_ret = qtm_acquisition_process();
//         
//         touch_check_node_cc_cal();
//         
//         if(TOUCH_SUCCESS == touch_ret)
//         {            
//             /* Returned with success: Start module level post processing */
//             touch_ret = qtm_freq_hop_autotune(&qtm_freq_hop_autotune_control1);
//             if (TOUCH_SUCCESS != touch_ret) {
//                 qtm_error_callback(0x41);
//             }
//             
//             touch_ret = qtm_key_sensors_process(&qtlib_key_set1);
//             if (TOUCH_SUCCESS != touch_ret)
//             {
//                 qtm_error_callback(0x42);
//             }
//             #if(SCROLLER_ENABLE == 1u)
//             touch_ret = qtm_scroller_process(&qtm_scroller_control1);
//             if (TOUCH_SUCCESS != touch_ret)
//             {
//                 qtm_error_callback(0x43);
//             }
//             #endif
//         }
//         else
//         {
//             /* Acq module Error Detected: Issue an Acq module common error code 0x80 */
//             qtm_error_callback(0x80);
//         }
// 
// 
//         if (0u != (qtlib_key_set1.qtm_touch_key_group_data->qtm_keys_status & QTM_KEY_REBURST))
//         {
//             time_to_measure_touch_flag = 1u;
//         }
//         else
//         {
//             measurement_done_touch = 1u;
//         }
//         qtm_post_process_complete();
//     }
//     
// }

/*============================================================================
 * Helper functions
============================================================================*/
uint16_t get_sensor_node_signal(uint16_t sensor_node)
{
    return (adc_qtlib_node_stat1[sensor_node].node_acq_signals);
}

void update_sensor_node_signal(uint16_t sensor_node, uint16_t new_signal)
{
    adc_qtlib_node_stat1[sensor_node].node_acq_signals = new_signal;
}

uint16_t get_sensor_node_reference(uint16_t sensor_node)
{
    return (qtlib_key_data_set1[sensor_node].channel_reference);
}

void update_sensor_node_reference(uint16_t sensor_node, uint16_t new_reference)
{
    qtlib_key_data_set1[sensor_node].channel_reference = new_reference;
}

uint16_t get_sensor_cc_val(uint16_t sensor_node)
{
    return (adc_qtlib_node_stat1[sensor_node].node_comp_caps);
}

