gururaj-shet/dsPIC-AI-Demo-AEC-EQ/src/touch/touch.c
void update_sensor_cc_val(uint16_t sensor_node, uint16_t new_cc_value)
{
    adc_qtlib_node_stat1[sensor_node].node_comp_caps = new_cc_value;
}

uint8_t get_sensor_state(uint16_t sensor_node)
{
    return (qtlib_key_data_set1[sensor_node].sensor_state);
}
uint8_t get_sensor_threshold(uint16_t sensor_node)
{
    return (qtlib_key_configs_set1[sensor_node].channel_threshold);
}
void update_sensor_state(uint16_t sensor_node, uint8_t new_state)
{
    qtlib_key_set1.qtm_touch_key_data[sensor_node].sensor_state = new_state;
}

void calibrate_node(uint16_t sensor_node)
{
    /* Calibrate Node */
    qtm_calibrate_sensor_node(&qtlib_acq_set1, sensor_node);
    /* Initialize key */
    qtm_init_sensor_key(&qtlib_key_set1, sensor_node, &adc_qtlib_node_stat1[sensor_node]);
}

uint8_t get_current_frequency(void)
{
    return *qtm_freq_hop_autotune_config1.freq_option_select;
}

uint8_t get_filter_frequency(uint8_t idx)
{
    return qtm_freq_hop_autotune_config1.median_filter_freq[idx];
}

uint8_t get_scroller_state(uint16_t sensor_node)
{
	return (qtm_scroller_control1.qtm_scroller_data[sensor_node].scroller_status);
}

uint16_t get_scroller_position(uint16_t sensor_node)
{
	return (qtm_scroller_control1.qtm_scroller_data[sensor_node].position);
}

uint16_t get_scroller_contact_size(uint16_t sensor_node)
{
    return (qtm_scroller_control1.qtm_scroller_data[sensor_node].contact_size);
}

uint16_t get_scroller_contact_threshold(uint16_t sensor_node)
{
    return (qtm_scroller_control1.qtm_scroller_config[sensor_node].contact_min_threshold);
}

/*============================================================================
ISR(ITC)
------------------------------------------------------------------------------
Purpose  :  Interrupt handler for PITC Interrupt
Input    :  none
Output   :  none
Notes    :  This interrupt is called when all CVD conversions for one channel are completed. 
============================================================================*/
void __attribute__((interrupt)) _ITCInterrupt()
{

    qtm_dspic33a_touch_handler_eoc();    

}
#endif /* TOUCH_C */


#endif //defined(ENA_TOUCH)
